util/soapparse/example/source.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><Request xmlns="http://tempuri.org/"><requestXML>&lt;?xml version="1.0"?&gt;
&lt;Request&gt;
  &lt;Header UserID="900407" RequestID="ff493da6-9887-4f93-abbc-27e0853dfcea" RequestType="Arch.Base.ImageWS.SaveImage" ClientIP="10.32.20.140" AsyncRequest="false" Timeout="0" MessagePriority="3" AssemblyVersion="1.0.2.6" RequestBodySize="0" SerializeMode="Xml" RouteStep="1" /&gt;
  &lt;SaveRequest&gt;
    &lt;FileBytes&gt;AAABAAEAEBAAAAEAGABzAAAAFgAAAIlQTkcNChoKAAAADUlIRFIAAAAQAAAAEAgGAAAAH/P/YQAAADpJREFUOI1j+O4n9x8XZmBgYKjfxfAfF2ZgYGBgGDVgMBhAOVjy/j9OzMDA8H8nw39ceNSAwWMAhQAATZ7kg1GSNy4AAAAASUVORK5CYII=&lt;/FileBytes&gt;
    &lt;CheckItem&gt;
      &lt;Types&gt;
        &lt;ImgFormat&gt;Jpg&lt;/ImgFormat&gt;
        &lt;ImgFormat&gt;Gif&lt;/ImgFormat&gt;
        &lt;ImgFormat&gt;Png&lt;/ImgFormat&gt;
      &lt;/Types&gt;
      &lt;MaxBytes&gt;8048000&lt;/MaxBytes&gt;
      &lt;MinWidth&gt;0&lt;/MinWidth&gt;
      &lt;MinHeight&gt;0&lt;/MinHeight&gt;
      &lt;MaxWidth&gt;0&lt;/MaxWidth&gt;
      &lt;MaxHeight&gt;0&lt;/MaxHeight&gt;
    &lt;/CheckItem&gt;
    &lt;OriginalFormat&gt;Jpg&lt;/OriginalFormat&gt;
    &lt;SaveType&gt;New&lt;/SaveType&gt;
    &lt;TargetFormat&gt;Jpg&lt;/TargetFormat&gt;
    &lt;SourceSaveMode&gt;Both&lt;/SourceSaveMode&gt;
    &lt;TargetQuality&gt;86&lt;/TargetQuality&gt;
    &lt;ObjectID&gt;0&lt;/ObjectID&gt;
    &lt;Channel&gt;tuangou&lt;/Channel&gt;
    &lt;StorageType&gt;Random&lt;/StorageType&gt;
    &lt;Process&gt;
      &lt;anyType d4p1:type="ProcessGroup" xmlns:d4p1="http://www.w3.org/2001/XMLSchema-instance"&gt;
        &lt;ID&gt;1&lt;/ID&gt;
        &lt;List&gt;
          &lt;anyType d4p1:type="Cropping"&gt;
            &lt;ID&gt;0&lt;/ID&gt;
            &lt;Proportion&gt;1&lt;/Proportion&gt;
            &lt;TargetFormat&gt;Jpg&lt;/TargetFormat&gt;
            &lt;TargetQuality&gt;0&lt;/TargetQuality&gt;
            &lt;IsSharpen&gt;false&lt;/IsSharpen&gt;
            &lt;Radius&gt;0&lt;/Radius&gt;
            &lt;Sigma&gt;0&lt;/Sigma&gt;
            &lt;Channels&gt;Undefined&lt;/Channels&gt;
          &lt;/anyType&gt;
          &lt;anyType d4p1:type="Compression"&gt;
            &lt;width&gt;20&lt;/width&gt;
            &lt;height&gt;20&lt;/height&gt;
            &lt;ID&gt;0&lt;/ID&gt;
            &lt;Width&gt;20&lt;/Width&gt;
            &lt;Height&gt;20&lt;/Height&gt;
            &lt;TargetFormat&gt;Jpg&lt;/TargetFormat&gt;
            &lt;TargetQuality&gt;0&lt;/TargetQuality&gt;
            &lt;Magnify&gt;false&lt;/Magnify&gt;
            &lt;IsSharpen&gt;false&lt;/IsSharpen&gt;
            &lt;Radius&gt;0&lt;/Radius&gt;
            &lt;Sigma&gt;0&lt;/Sigma&gt;
            &lt;Channels&gt;Undefined&lt;/Channels&gt;
          &lt;/anyType&gt;
        &lt;/List&gt;
        &lt;ExName&gt;_20_20&lt;/ExName&gt;
        &lt;TargetFormat&gt;Jpg&lt;/TargetFormat&gt;
        &lt;TargetQuality&gt;0&lt;/TargetQuality&gt;
        &lt;IsSharpen&gt;false&lt;/IsSharpen&gt;
        &lt;Radius&gt;0&lt;/Radius&gt;
        &lt;Sigma&gt;0&lt;/Sigma&gt;
        &lt;Channels&gt;Undefined&lt;/Channels&gt;
      &lt;/anyType&gt;
    &lt;/Process&gt;
  &lt;/SaveRequest&gt;
&lt;/Request&gt;</requestXML></Request></soap:Body></soap:Envelope>